import streamlit as st
st.title('碳点的制备和检测')
st.subheader('一. 实验材料：')
st.text('''
1.原料：无花果叶
2.溶剂：去离子水：用于溶解无花果叶并作为反应介质
3.实验容器：烧杯，研钵和研杵，烘箱，天平
4.表征仪器：投射电子显微镜（TEM），傅立叶变换红外光谱（FTIR）
''')
st.subheader('二．实验步骤：')
st.text('''
1.预处理：将无花果叶清洗干净，去除表面泥沙和杂质，将叶片切碎并用研钵和研杵
研磨成粉末状，提高提取效率，后称取质量。
2.溶解与反应：将无花果叶粉放于烧杯中，加入去离子水，形成悬浊液。
之后将悬浊液放置于烘箱中，在200℃下煅烧12小时。煅烧结束后自然冷却干燥，
得到CDs粉体，用于进一步表征和应用
3.纯化：将产物溶液装入透析袋（截留分子量为3000Da）透析2天，
中间换水3-4次，得到纯化的CDs溶液。
''')
st.subheader('三.碳点的表征：')
st.text('''
1.通过透射电子显微镜（TEM）观察TM-CDs的微观形貌、尺寸和晶体结构。
正常状态下TEM 图像显示碳点在 1-10nm 范围内呈准球形。操作如下：选取
分散剂乙醇并超声20 min，随后将样品滴加到超薄碳膜表面，烘干15 min后
测试，观察所得 研究样品的颗粒大小、微观形貌及样品成分情况。
2.傅立叶变换红外光谱（FTIR）检测碳点的化学组成和官能团：将所测样品
与分析纯溴化钾放在容器中使用红外烘干器干燥，然后将干燥后 的待测试样与
溴化钾按照1∶100的比例混合均匀并研磨，之后进行压片操作将其制备成透明
薄片。扫描范围为500～4 000 cm－1。
''')